## [ethanhassett](https://hassettio.app.spacelift.io/stack/ethanhassett/run/01J9HPKCP7QYR1VP4HTCHYHS72) plan logs

<details>
<summary>Click here to expand</summary>

```
[01J9C223HVY4737A6JBFZVRXWJ] Planning changes with 0 custom hooks...
data.hcp_vault_secrets_secret.google_credentials: Reading...
data.hcp_vault_secrets_secret.cloudflare_api_token: Reading...
data.hcp_vault_secrets_secret.google_credentials: Read complete after 0s [id=spacelift]
data.hcp_vault_secrets_secret.cloudflare_api_token: Read complete after 0s [id=spacelift]
data.cloudflare_zone.this: Reading...
google_service_account.cloud_run: Refreshing state... [id=projects/ethanhassett/serviceAccounts/cloudrun@ethanhassett.iam.gserviceaccount.com]
google_project_iam_binding.service_account_user: Refreshing state... [id=ethanhassett/roles/iam.serviceAccountUser]
google_project_iam_binding.cloud_run_admin: Refreshing state... [id=ethanhassett/roles/run.admin]
google_cloud_run_v2_service.this: Refreshing state... [id=projects/ethanhassett/locations/us-east1/services/ethanhassett]
data.cloudflare_zone.this: Read complete after 1s [id=f96446d78e054da3fe5c6ace7557f782]
google_cloud_run_domain_mapping.this: Refreshing state... [id=locations/us-east1/namespaces/ethanhassett/domainmappings/ethanhassett.com]
google_cloud_run_service_iam_binding.this: Refreshing state... [id=v1/projects/ethanhassett/locations/us-east1/services/ethanhassett/roles/run.invoker]

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # google_cloud_run_domain_mapping.this has changed
  ~ resource "google_cloud_run_domain_mapping" "this" {
        id       = "locations/us-east1/namespaces/ethanhassett/domainmappings/ethanhassett.com"
        name     = "ethanhassett.com"
      ~ status   = [
          ~ {
              ~ conditions          = [
                    {
                        message = "Waiting for certificate provisioning. You must configure your DNS records for certificate issuance to begin."
                        reason  = "CertificatePending"
                        status  = "Unknown"
                        type    = "Ready"
                    },
                  ~ {
                      ~ message = "" -> "Certificate issuance pending."
                      ~ reason  = "" -> "CertificatePending"
                        # (2 unchanged attributes hidden)
                    },
                    {
                        message = ""
                        reason  = ""
                        status  = "True"
                        type    = "DomainRoutable"
                    },
                  ~ {
                      ~ message = "System will retry after 0:01:00 from lastTransitionTime for polling interval" -> "System will retry after 0:05:00 from lastTransitionTime for polling interval"
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (3 unchanged attributes hidden)
            },
        ]
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # cloudflare_record.this["0"] will be created
  + resource "cloudflare_record" "this" {
      + allow_overwrite = false
      + content         = "216.239.32.21"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.this["1"] will be created
  + resource "cloudflare_record" "this" {
      + allow_overwrite = false
      + content         = "216.239.34.21"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.this["2"] will be created
  + resource "cloudflare_record" "this" {
      + allow_overwrite = false
      + content         = "216.239.36.21"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.this["3"] will be created
  + resource "cloudflare_record" "this" {
      + allow_overwrite = false
      + content         = "216.239.38.21"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.this["4"] will be created
  + resource "cloudflare_record" "this" {
      + allow_overwrite = false
      + content         = "2001:4860:4802:32::15"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.this["5"] will be created
  + resource "cloudflare_record" "this" {
      + allow_overwrite = false
      + content         = "2001:4860:4802:34::15"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.this["6"] will be created
  + resource "cloudflare_record" "this" {
      + allow_overwrite = false
      + content         = "2001:4860:4802:36::15"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

  # cloudflare_record.this["7"] will be created
  + resource "cloudflare_record" "this" {
      + allow_overwrite = false
      + content         = "2001:4860:4802:38::15"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "f96446d78e054da3fe5c6ace7557f782"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

[01J9C223HVY4737A6JBFZVRXWJ] Changes are GO
[01J9C223HVY4737A6JBFZVRXWJ] Uploading the list of managed resources...
[01J9C223HVY4737A6JBFZVRXWJ] Please be aware that the run changes calculation includes output changes.
[01J9C223HVY4737A6JBFZVRXWJ] Resource list upload is GO
[01J9C223HVY4737A6JBFZVRXWJ] Generating JSON representation of the plan...
[01J9C223HVY4737A6JBFZVRXWJ] JSON representation is GO
[01J9C223HVY4737A6JBFZVRXWJ] Loading custom plan policy inputs...
[01J9C223HVY4737A6JBFZVRXWJ] 0 custom plan policy inputs found
[01J9C223HVY4737A6JBFZVRXWJ] No plan policies to evaluate
```

</details>